{
  "mainSection": {
    "title": "Системы машинного зрения"
  },
  "textSection": {
    "title": "IdealTechno специализируется на разработке и поставке систем машинного зрения, применяемых в различных задачах.",
    "subtitle": "Ниже приведены некоторые из успешных проектов, реализованных нашей командой, мы проектируем систему машинного зрения по запросу нашего клиента."
  },
  "section1": {
    "first": {
      "title": "Контроль качества туши",
      "subtitle": "Разработанная систему мониторинга с использованием искусственного интеллекта для скотобоен с централизованной информационной панелью для визуализации и анализа\u2028состояния туш на конвейерной линии скотобойни. Усовершенствованное решение для подсчета предназначено для оснащения скотобоен возможностью квалифицированного подсчета, управления и составления отчетов о количестве туш на каждом предприятии, а также для классификации туш."
    },
    "second": {
      "title": "Оборудование",
      "subtitle": "-Обработка изображений с использованием искусственного интеллекта<br>-Подсчет товара и контроль его качества<br>-Мониторинг подозрительного поведения<br>-Аналитика посетителей и бизнес-отчеты"
    }
  },
  "section2": {
    "first": {
      "title": "Подсчет коробок с креветками",
      "subtitle": "Система технического зрения применяется на заводе по производству креветок для подсчета ящиков и определения их различных размеров. Система определяет маленькие ведра, большие ведра и пустые ведр"
    },
    "second": {
      "title": "Особенности",
      "subtitle": "-Видеопоток с камеры RTSP<br>-Обнаружение и подсчет полных и пустых ячеек в режиме реального времени.<br>-Обнаружение и подсчет размеров ячеек в режиме реального времени."
    }
  },
  "section3": {
    "first": {
      "title": "Обнаружение колпачка и анализ ориентации",
      "subtitle": "Проект был реализован на заводе, где для розлива различных видов продукции в бутылки разного объема, для каждого типа жидкости и бутылки использовались разные колпачки. Всего на заводе использовались 8 различных типов колпачков."
    },
    "second": {
      "title": "Особенности",
      "subtitle": "Система машинного зрения распознает крышку и анализирует ее ориентацию, затем передает положение и ориентацию крышки в режиме реального времени роботу, который выбирает крышку и помещает ее на верхнюю часть бутылки."
    }
  },
  "section4": {
    "first": {
      "title": "Обнаружение и сегментация дефектов стали",
      "subtitle": "В рамках проекта на заводе по производству стали на производственной линии была установлена система машинного зрения, которая используется для обнаружения и классификации дефектов на стальном листе, а также для сегментации области дефекта."
    },
    "second": {
      "title": "Особенности",
      "subtitle": "-Камера 5 Мп с телецентрическим объективом.<br>-Пользовательский интерфейс разработан PyQt5<br>-Графический процессор NVIDIA Jetson Nano."
    }
  },
  "section5": {
    "first": {
      "title": "Сегментация зуба",
      "subtitle": "Проект был реализован в стоматологической клинике, где используется система машинного зрения для определения идентификатора зуба, сегментации формы зуба и сегментации области поврежденного зуба"
    },
    "second": {
      "title": "Особенности",
      "subtitle": "-Камера 5 Мп с телецентрическим объективом<br>-Пользовательский интерфейс разработан PyQt5"
    }
  },
  "section6": {
    "first": {
      "title": "Виртуальная безопасность",
      "subtitle": "Проект реализован в качестве прототипа для применения системы виртуальных ограждений для измерения безопасности, состояния ожидания, когда рука(и) не пересекает виртуальное ограждение, и состояния предупреждения, когда рука(и) пересекает виртуальное ограждение."
    },
    "second": {
      "title": "Особенности",
      "subtitle": "-Камера 5 Мп с телецентрическим объективом<br>-Пользовательский интерфейс разработан PyQt5"
    }
  }
}
